Public Member Functions | Protected Attributes | List of all members
ACAPI::AddonServiceInterface Class Referenceabstract
API Infrastructure
AddonServiceInterface is the abstract base class for every concrete service interface class. More...
#include <AddonServiceInterface.hpp>
 Inheritance diagram for ACAPI::AddonServiceInterface:
 Public Member Functions
AddonServiceInterface (const API_Guid &serviceIdentifier)
Creates and registers the AddonServiceInterface.
Result< void >  | GetStatus (const API_Token &token) const
Get the status of the service registration.
virtual GSErrCode  | Initialize ()
The callback function for the initialization phase.
virtual GSErrCode  | RegisterInterface ()
The callback function for the interface registration phase.
 Protected Attributes
 ACAPI::Error  | status
The error status of the registration.
 const API_Guid  | serviceIdentifier
Identifier given by constructor.
Detailed Description
AddonServiceInterface is the abstract base class for every concrete service interface class.
Since
Archicad 29
Constructor & Destructor Documentation
◆ AddonServiceInterface()
 ACAPI::AddonServiceInterface::AddonServiceInterface  |  ( |  const API_Guid & |  serviceIdentifier | )
Creates and registers the AddonServiceInterface.
Parameters
serviceIdentifier | API guid that identifies the service implementation.
Member Function Documentation
◆ GetStatus()
 Result< void > ACAPI::AddonServiceInterface::GetStatus  |  ( |  const API_Token & |  token | ) |   const
Get the status of the service registration.
Parameters
token | The token of the AddOn.
Returns
The error code and message if there is any, otherwise nothing.
◆ Initialize()
 virtual GSErrCode ACAPI::AddonServiceInterface::Initialize  |  ( |   | )
virtual
The callback function for the initialization phase.
Returns
NoError if everything went well, otherwise the error code.
◆ RegisterInterface()
 virtual GSErrCode ACAPI::AddonServiceInterface::RegisterInterface  |  ( |   | )
virtual
The callback function for the interface registration phase.
Returns
NoError if everything went well, otherwise the error code.
Reimplemented in ACAPI::ModelCheckMethodCallback.